/*
Задача 25: Напишите цикл, который принимает на вход два числа (A и B) 
и возводит число A в натуральную степень B.
3, 5 -> 243 (3⁵)
2, 4 -> 16
*/

/*int A, B;
Console.Write($"Введите число: ");
int.TryParse(Console.ReadLine()!, out A);
Console.Write($"Введите степень: ");
int.TryParse(Console.ReadLine()!, out B);

int num = A;
for (int i = 1; i < B; i++)
{
    num = num * A;
}
Console.Write($"Число {A} в степени {B} = {num}");*/

/*
Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

452 -> 11
82 -> 10
9012 -> 12
*/

// int n;
// Console.Write($"Введите число: ");
// int.TryParse(Console.ReadLine()!, out n);



// int N = n;
// int sum = 0;


// while (N != 0)
// {
//     sum = sum + N % 10;
//     N = N/10;
// }
// Console.Write($"Сумма чисел {n} равна: " + sum);

