//Задача 10: Напишите программу, которая принимает на вход трёхзначное число 
//и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1


// int a;
// Console.Write($"Введите 3-х значное число: ");
// int.TryParse(Console.ReadLine()!, out a);

// if (a > 99)
// {
//     Console.Write((a / 10) % 10);
// }

// Задача 13: Напишите программу, которая выводит третью цифру заданного числа 
//или сообщает, что третьей цифры нет.

// 645 -> 5

// 78 -> третьей цифры нет

// 32679 -> 6

// int a;
// Console.Write($"Введите число: ");
// int.TryParse(Console.ReadLine()!, out a);

//     if (a >= 100)
//         {
//             while (a > 999)
//             {
//                 a /= 10;
//             }
//                 a %= 10;
//             Console.WriteLine($"Третья цифра заданного числа: " + a);
                
//         }
//             else
//                 {
//                     Console.WriteLine($"Третьей цифры числа нет");
//                 }
//             return a; 

// Задача 15: Напишите программу, которая принимает на вход цифру, 
//обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет    

// int a;
// Console.Write($"Введите цифру дня недели: ");
// int.TryParse(Console.ReadLine()!, out a);
    
//     if (a % 7 == 0 || a % 6 == 0)
//         Console.Write($"ДА");
//         else
//         Console.Write($"Нет");
         
    