#pragma warning disable

/*
Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.

0, 7, 8, -2, -2 -> 2
1, -7, 567, 89, 223-> 3
*/
// Console.Write($"Введите кол-во элементов массива: ");

// int Mass;
// int.TryParse(Console.ReadLine()!, out Mass);
// int [] Array = new int[Mass];


// for (int i = 0; i < Array.Length; i++)
// {
//     Console.Write($"Введите элемент массива {i}: ");
//     Array[i] = int.Parse(Console.ReadLine());
// }

// int count = 0;

// for (int i = 0; i < Array.Length; i++)
// {
//     if (Array[i] > 0)
//     {
//         count++;
//     }
// }
// Console.Write($"Колличество чисел > 0: {count}");

/*
Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, 
заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; 
значения b1, k1, b2 и k2 задаются пользователем.

b1 = 2, k1 = 5, b2 = 4, k2 = 9 -> (-0,5; -0,5)
*/

// double b1;
// Console.Write($"Введите значение b1 ");
// double.TryParse(Console.ReadLine()!, out b1);
// double k1;
// Console.Write($"Введите значение k1 ");
// double.TryParse(Console.ReadLine()!, out k1);
// double b2;
// Console.Write($"Введите значение b2 ");
// double.TryParse(Console.ReadLine()!, out b2);
// double k2;
// Console.Write($"Введите значение k2 ");
// double.TryParse(Console.ReadLine()!, out k2);

// double x = (b2 - b1)/(k1 - k2);
// double y = k2 * x + b2;

// Console.Write($"Точка пересечения двух прямых на координате X: {x}, Y: {y}");
